Repository: RolandDoyen/MyPortofolioPublic
Catalog: MyPortfolio/Resources/Resources.*.resx
Languages: fr

# Index_Hello
source: Hello, I am
fr: Bonjour, je suis

source: Projects
fr: Projets

source: Download CV
fr: Télécharger le CV

# API_Title
source: API - Movies
fr: API - Films

# API_Description
source: A <strong>robust</strong> .NET 8 API providing a JSON-based CRUD interface for movie data. It features <strong>JWT authentication</strong>, strict <strong>uniqueness constraints</strong>, and a centralized error-handling middleware, optimized for asynchronous AJAX operations.
fr: Une API .NET 8 <strong>robuste</strong> offrant une interface CRUD JSON pour les données cinématographiques. Elle intègre l'<strong>authentification JWT</strong>, des contraintes d'<strong>unicité strictes</strong> et un middleware de gestion d'erreurs centralisé, optimisé pour les opérations AJAX asynchrones.

# ClanManager_Description
source: A comprehensive <strong>ASP.NET Core 8 MVC</strong> application designed to manage gaming communities. It features <strong>Role-Based Access Control (RBAC)</strong> to handle clan creation, member recruitment, and leadership assignment. Built with a <strong>Layered Architecture</strong>, it ensures secure data persistence and features custom <strong>Auth filters</strong> for protected administrative and user routes.
fr: Une application complète en <strong>ASP.NET Core 8 MVC</strong> conçue pour la gestion de communautés de joueurs. Elle intègre un <strong>contrôle d'accès basé sur les rôles (RBAC)</strong> pour gérer la création de clans, le recrutement de membres et l'attribution de leaders. Développée selon une <strong>architecture en couches</strong>, elle garantit une persistance de données sécurisée et utilise des <strong>filtres d'autorisation</strong> personnalisés pour protéger les routes administratives et utilisateurs.

source: View my CV
fr: Voir mon CV

# Index_SeeProjects
source: View my projects
fr: Voir mes projets

# Portfolio_Description
source: Explore my portfolio to discover <strong>optimized</strong> .NET 8 and Full-Stack projects, showcasing clean architecture, secure RESTful APIs, and modern frontend integrations.
fr: Explorez mon portfolio pour découvrir des projets .NET 8 et Full-Stack <strong>optimisés</strong>, mettant en avant une architecture propre, des APIs REST sécurisées et des intégrations frontend modernes.

# Projects_Git
source: View on GitHub
fr: Voir sur GitHub

# Projects_Visit
source: Visit the site
fr: Visiter le site

# WEB_Description
source: A modern, responsive CRUD application designed to manage a cinema catalog. Features a decoupled architecture using <strong>Vanilla JavaScript</strong> to consume a <strong>.NET 8 REST API</strong> . Includes automated <strong>JWT authentication management</strong> , dynamic DOM updates, and standardized error handling.
fr: Une application CRUD moderne et responsive conçue pour la gestion d'un catalogue de cinéma. Elle présente une architecture découplée utilisant <strong>Vanilla JavaScript</strong> pour consommer une <strong>API REST .NET 8</strong>. Inclut une <strong>gestion automatisée de l'authentification JWT</strong>, des mises à jour dynamiques du DOM et une gestion standardisée des erreurs.

# WEB_Title
source: WEB - Movies
fr: WEB - Films

# Index_Description_3
source: This portfolio presents a selection of personal projects that reflect the way I work.
fr: Ce portfolio présente une sélection de projets personnels qui reflètent ma façon de travailler.

# Index_Presentation
source: a Fullstack .NET Developer with a strong backend focus, passionate about clean code and simple, functional design.
fr: Développeur Fullstack .NET avec une forte orientation backend, passionné par le "clean code" et le design simple et fonctionnel.

# Index_Description_1
source: I build reliable and maintainable applications, with close attention to code quality and a clear architecture.
fr: Je conçois des applications fiables et maintenables, en accordant une attention particulière à la qualité du code et à une architecture claire.

# Index_Description_2
source: I enjoy proposing simple, user-friendly solutions. When necessary, I’m not afraid to challenge requirements in order to better understand the real needs and deliver truly appropriate solutions.
fr: J’aime proposer des solutions simples et intuitives. Quand c’est nécessaire, je n’hésite pas à questionner les demandes pour mieux comprendre le besoin réel et apporter une solution vraiment adaptée.

source: My projects
fr: Mes projets

# React_Title
source: React - Movies
fr: React - Films

# Angular_Title
source: Angular - Movies
fr: Angular - Films

# React_Description
source: A modern, responsive CRUD application designed to manage a cinema catalog. Features a decoupled architecture using <strong>React</strong> to consume a <strong>.NET 8 REST API</strong> . Includes automated <strong>JWT authentication management</strong> , dynamic DOM updates, and standardized error handling.
fr: Une application CRUD moderne et responsive conçue pour la gestion d'un catalogue de cinéma. Elle présente une architecture découplée utilisant <strong>React</strong> pour consommer une <strong>API REST .NET 8</strong>. Inclut une <strong>gestion automatisée de l'authentification JWT</strong>, des mises à jour dynamiques du DOM et une gestion standardisée des erreurs.

# Angular_Description
source: A modern, responsive CRUD application designed to manage a cinema catalog. Features a decoupled architecture using <strong>Angular</strong> to consume a <strong>.NET 8 REST API</strong> . Includes automated <strong>JWT authentication management</strong> , dynamic DOM updates, and standardized error handling.
fr: Une application CRUD moderne et responsive conçue pour la gestion d'un catalogue de cinéma. Elle présente une architecture découplée utilisant <strong>Angular</strong> pour consommer une <strong>API REST .NET 8</strong>. Inclut une <strong>gestion automatisée de l'authentification JWT</strong>, des mises à jour dynamiques du DOM et une gestion standardisée des erreurs.
